OpenFOAM-dev/tutorials/multicomponentFluid/SandiaD_LTS/0/O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform 7.47e-4;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletCH4
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
